src/main/resources/message_unsigned_template.xml

<?xml version="1.0" encoding="UTF-8"?><tns:Envelope xmlns:tns="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:int="urn:EEC:Interaction:v1.0"><tns:Header>
    <wsa:To>EAEU://EEC/GATE/TTP/REQUEST</wsa:To>
    <wsa:From>
        <wsa:Address></wsa:Address>
    </wsa:From>
    <wsa:ReplyTo>
        <wsa:Address>jms:/GATEWAY.TTP.REPLY</wsa:Address>
    </wsa:ReplyTo>
    <wsa:FaultTo>
        <wsa:Address></wsa:Address>
    </wsa:FaultTo>
    <wsa:Action>int://SR/TTP/Sender/Incoming</wsa:Action>
    <wsa:MessageID>urn:uuid:3e0a55e2-c489-498a-8e6d-394d0b4bc37f</wsa:MessageID>
    <wsa:RelatesTo></wsa:RelatesTo>
    <int:ConversationID>urn:uuid:3e7fed5f-8f88-4c4b-9e91-ab757a9d9677</int:ConversationID>
    <int:ProcedureID>urn:uuid:3c90724b-b23c-4e43-8193-091866e86d49</int:ProcedureID>
    <int:Integration>
        <int:TrackID>urn:uuid:400c34d1-9ef2-4d9d-9d5c-cc50d36e616f</int:TrackID>
        <int:AcceptTime>2017-01-27T17:32:22+04:00</int:AcceptTime>
    </int:Integration>
    <soap:IsList xmlns:soap="http://www.w3.org/2003/05/soap-envelope">true</soap:IsList></tns:Header><tns:Body>
    <doc:SignedDoc xmlns:doc="urn:EEC:SignedData:v1.0:EDoc">
        <doc:Data Id="d3163513">
<doc:SignedContent DocInstance="I3163513" Id="c3163513">
            <ns5:EDocDetails xmlns:ns5="urn:EEC:R:OS:ED:01:EDoc:v0.1.8">
                <ns2:EDocHeader xmlns:ns2="urn:EEC:M:ComplexDataObjects:v0.4.3">
                    <InfEnvelopeCode xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">P.ED.01.MSG.001
                    </InfEnvelopeCode>
                    <EDocCode xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">R.000</EDocCode>
                    <EDocId xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">8ee40a61-132a-4da8-9e22-21666e7a7656
                    </EDocId>
                    <EDocDateTime xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">2016-12-03T11:47:47.544+03:00
                    </EDocDateTime>
                    <LanguageCode xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">ru</LanguageCode>
                </ns2:EDocHeader>
                <DocName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">МГТ КЗ 1.1</DocName>
                <ns3:DocTypeName xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8">{data}
                </ns3:DocTypeName>
                <ns3:EDocRegistrationId xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8">07.12/1.1
                </ns3:EDocRegistrationId>
                <ns3:EDocRegistrationDate xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8">2017-01-27+03:00
                </ns3:EDocRegistrationDate>
                <ns3:EDocPlace xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8">Москва</ns3:EDocPlace>
                <ns3:PageQuantity xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8">1</ns3:PageQuantity>
                <ns3:FileOrdinal xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8">1</ns3:FileOrdinal>
                <ns3:DocAccessRestrictionCode xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8">1
                </ns3:DocAccessRestrictionCode>
                <ns4:SendingSystemDetails xmlns:ns4="urn:EEC:M:OS:ComplexDataObjects:v0.1.8">
                    <ns3:SendingSystemCode xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8" codeListId="P.ED.01.CLS.003">05
                    </ns3:SendingSystemCode>
                    <ns3:SendingSystemName xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8">СЭД
                    </ns3:SendingSystemName>
                    <DescriptionText xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Система электронного
                        документооборота
                    </DescriptionText>
                </ns4:SendingSystemDetails>
                <ns4:OrganizationSenderDetails xmlns:ns4="urn:EEC:M:OS:ComplexDataObjects:v0.1.8">
                    <ns3:ManagingAuthorityCode xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8" codeListId="P.ED.01.CLS.003">RU01
                    </ns3:ManagingAuthorityCode>
                    <OrganizationName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">ФГУП НИИ «Восход»
                    </OrganizationName>
                    <OrganizationBriefName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">ФГУП НИИ «Восход»
                    </OrganizationBriefName>
                    <ns4:Alpha2AddressDetails>
                        <UnifiedCountryCode xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3" codeListId="P.ED.01.CLS.003">RU
                        </UnifiedCountryCode>
                        <TerritoryCode xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">45286585000</TerritoryCode>
                        <PostCode xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">125375</PostCode>
                        <RegionName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">город Москва</RegionName>
                        <DistrictName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Тверской</DistrictName>
                        <CityName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Москва</CityName>
                        <StreetName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Тверская улица</StreetName>
                        <BuildingNumberId xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">7</BuildingNumberId>
                        <AddressText xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">125375, г.Москва, ул.Тверская,
                            д.7
                        </AddressText>
                    </ns4:Alpha2AddressDetails>
                    <ns2:CommunicationDetails xmlns:ns2="urn:EEC:M:ComplexDataObjects:v0.4.3">
                        <CommunicationChannelCode xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">TE
                        </CommunicationChannelCode>
                        <CommunicationChannelName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Телефон
                        </CommunicationChannelName>
                        <CommunicationChannelId xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">+7 (495) 771-80-00
                        </CommunicationChannelId>
                    </ns2:CommunicationDetails>
                    <ns4:OfficialDetails>
                        <ns3:FullName xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8">Ильичев В. Е.
                        </ns3:FullName>
                        <LastName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Ильичев</LastName>
                        <FirstName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">В.</FirstName>
                        <MiddleName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Е.</MiddleName>
                        <ns3:DepartmentName xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8">Департамент защиты
                            внутреннего рынка
                        </ns3:DepartmentName>
                        <PositionName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Директор Департамента
                        </PositionName>
                    </ns4:OfficialDetails>
                </ns4:OrganizationSenderDetails>
                <ns4:OrganizationAuthorDetails xmlns:ns4="urn:EEC:M:OS:ComplexDataObjects:v0.1.8">
                    <ns3:ManagingAuthorityCode xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8" codeListId="P.ED.01.CLS.003">RU02
                    </ns3:ManagingAuthorityCode>
                    <OrganizationName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">
                        ФГУП НИИ «Восход»
                    </OrganizationName>
                    <OrganizationBriefName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">
                        ФГУП НИИ «Восход»
                    </OrganizationBriefName>
                    <ns4:Alpha2AddressDetails>
                        <UnifiedCountryCode xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3" codeListId="P.ED.01.CLS.003">RU
                        </UnifiedCountryCode>
                        <TerritoryCode xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">45286585000</TerritoryCode>
                        <PostCode xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">125375</PostCode>
                        <RegionName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">город Москва</RegionName>
                        <DistrictName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Тверской</DistrictName>
                        <CityName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Москва</CityName>
                        <StreetName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Тверская улица</StreetName>
                        <BuildingNumberId xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">7</BuildingNumberId>
                        <AddressText xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">125375, г.Москва, ул.Тверская,
                            д.7
                        </AddressText>
                    </ns4:Alpha2AddressDetails>
                    <ns3:EDocRegistrationId xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8">03.12 - 1
                    </ns3:EDocRegistrationId>
                    <ns3:EDocRegistrationDate xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8">
                        2016-12-03+03:00
                    </ns3:EDocRegistrationDate>
                </ns4:OrganizationAuthorDetails>
                <ns4:OrganizationReceiverDetails xmlns:ns4="urn:EEC:M:OS:ComplexDataObjects:v0.1.8">
                    <ns3:ManagingAuthorityCode xmlns:ns3="urn:EEC:M:OS:SimpleDataObjects:v0.1.8" codeListId="P.ED.01.CLS.003">EEC
                    </ns3:ManagingAuthorityCode>
                    <OrganizationName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Евразийская экономическая
                        комиссия
                    </OrganizationName>
                    <OrganizationBriefName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">ЕЭК
                    </OrganizationBriefName>
                    <ns4:Alpha2AddressDetails>
                        <UnifiedCountryCode xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3" codeListId="P.ED.01.CLS.003">RU
                        </UnifiedCountryCode>
                        <TerritoryCode xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">45286590000</TerritoryCode>
                        <PostCode xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">119121</PostCode>
                        <RegionName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">город Москва</RegionName>
                        <DistrictName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Хамовники</DistrictName>
                        <CityName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Москва</CityName>
                        <StreetName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Смоленский бульвар</StreetName>
                        <BuildingNumberId xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">3/5 стр.1
                        </BuildingNumberId>
                        <AddressText xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">119121, г. Москва, Смоленский
                            бульвар, д.3/5, стр. 1
                        </AddressText>
                    </ns4:Alpha2AddressDetails>
                    <ns2:CommunicationDetails xmlns:ns2="urn:EEC:M:ComplexDataObjects:v0.4.3">
                        <CommunicationChannelCode xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">TE
                        </CommunicationChannelCode>
                        <CommunicationChannelName xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">Телефон
                        </CommunicationChannelName>
                        <CommunicationChannelId xmlns="urn:EEC:M:SimpleDataObjects:v0.4.3">+7 (495) 669-24-00,
                            доб. 41-33
                        </CommunicationChannelId>
                    </ns2:CommunicationDetails>
                </ns4:OrganizationReceiverDetails>
            </ns5:EDocDetails>
        </doc:SignedContent>
        </doc:Data>
    </doc:SignedDoc>
</tns:Body></tns:Envelope>